# Задание №5
# Запросить у пользователя ввод числа. Построить цикл от 0 до введённого числа (включительно) и
# для чётных чисел вывести то, что они чётные, а для нечётных, что они нечётные.
# Пример вывода:
# 0 is EVEN
# 1 is ODD
# 2 is EVEN
# и так далее...

def even_or_odd(number_of_lines):
    for i in range(number_of_lines + 1):
        print(i, 'is EVEN') if ((i % 2) == 0) else print(i, 'is ODD')
