# Задание №1
# Клиент покупает кофе в кафе. За каждые 6 чашек, 1 чашка даётся в качестве бонуса.
# Задача: запросить у пользователя кол-во чашек на покупку, вычислить полагающееся кол-во бонусных чашек кофе
# и вывести это число на консоль.
# a = input('Введите число покупаемых чашек: ')
# print('Кол-во бонусных чашек:', int(a) // 6)

# Задание №2
# Запросить у пользователя координаты x и y двух точек на плоскости.
# Посчитать расстояние между заданными точками и вывести результат на консоль с точностью до трёх
# знаков после запятой (плавающей точки).
# nums = input('Введите координаты двух точек в формате x1 y1 x2 y2: ')
# first_x = int(nums.split(" ")[0])
# first_y = int(nums.split(" ")[1])
# second_x = int(nums.split(" ")[2])
# second_y = int(nums.split(" ")[3])
# print('Расстояние между точками: ', '{:.3f}'.format((((second_x-first_x) ** 2) + ((second_y-first_y) ** 2)) ** 0.5))

# Задание №3
# На ферме есть куры, коровы и свиньи. У курицы две ноги, у свиньи - четыре, у коровы - четыре.
# Запросить у пользователя (фермера) ввод кол-ва кур, свиней и коров,
# просуммировать кол-во ног всех животных и вывести результат на консоль.
# animals = input('Введите кол-во кур, свиней и коров в формате x y z: ')
# chicken = int(animals.split(" ")[0])
# pig = int(animals.split(" ")[1])
# cow = int(animals.split(" ")[2])
# print('Кол-во ног животных: ', (chicken * 2 + (pig + cow) * 4))

# Задание №4
# Вывести лесенкой символ звёздочки по кол-ву строк, заданных пользователем:
# запросить ввод у пользователя кол-ва строк, вывести звёздочки лесенкой.
# - Например, пользователь ввёл число 2. Тогда выводим:
# *
# **
# - Например, пользователь ввёл число 4. Тогда выводим:
# *
# **
# ***
# ****
# и так далее, смысл должен быть ясен.
# a = int(input('Введите число: '))
# s = '*'
# for i in range(a):
#     print(s)
#     s += '*'

# Задание №5
# Запросить у пользователя ввод числа. Построить цикл от 0 до введённого числа (включительно) и
# для чётных чисел вывести то, что они чётные, а для нечётных, что они нечётные.
# Пример вывода:
# 0 is EVEN
# 1 is ODD
# 2 is EVEN
# и так далее...
# a = int(input('Введите число: '))
# for i in range(a+1):
#     if ((i % 2) == 0):
#         print(i, 'is EVEN')
#     else:
#         print(i, 'is ODD')

#Задание №6
# Вы получаете ввод числа от пользователя. Построить цикл от нуля до введенного числа (включительно)
# и посчитать сумму всех чисел, делимых без остатка на 3 или 5. Вывести это число на консоль.
# k = 0
# a = int(input('Введите число: '))
# for i in range(a+1):
#     if ((i % 3) == 0) or ((i % 5) == 0):
#         k += i
# print(k)