# Задание №5
# Запросить у пользователя ввод числа. Построить цикл от 0 до введённого числа (включительно) и
# для чётных чисел вывести то, что они чётные, а для нечётных, что они нечётные.
# Пример вывода:
# 0 is EVEN
# 1 is ODD
# 2 is EVEN
# и так далее...
number_of_lines = int(input('Введите число: '))
for i in range(number_of_lines+1):
    if ((i % 2) == 0):
        print(i, 'is EVEN')
    else:
        print(i, 'is ODD')