# Задание №1
# Клиент покупает кофе в кафе. За каждые 6 чашек, 1 чашка даётся в качестве бонуса.
# Задача: запросить у пользователя кол-во чашек на покупку, вычислить полагающееся кол-во бонусных чашек кофе
# и вывести это число на консоль.
number_of_cups = input('Введите число покупаемых чашек: ')
print('Кол-во бонусных чашек:', int(number_of_cups) // 6)

