
# Задание №4
# Вывести лесенкой символ звёздочки по кол-ву строк, заданных пользователем:
# запросить ввод у пользователя кол-ва строк, вывести звёздочки лесенкой.
# - Например, пользователь ввёл число 2. Тогда выводим:
# *
# **
# - Например, пользователь ввёл число 4. Тогда выводим:
# *
# **
# ***
# ****
# и так далее, смысл должен быть ясен.
number_of_lines = int(input('Введите число: '))
star_symbol = '*'
for i in range(number_of_lines):
    print(star_symbol)
    star_symbol += '*'